package src.tamagotch.core.algo;
import java.util.Random;

public final class Algo {
    public static String randomName() {
        String[] A = {
                "멋있는", "착한", "이쁜", "못생긴", "귀여운",
                "용감한", "겁많은", "똑똑한", "바보같은", "졸린",
                "배고픈", "뚱뚱한", "날씬한", "빠른", "느린",
                "화난", "신난", "우울한", "행복한", "외로운",
                "수상한", "이상한", "평범한", "특별한", "엉뚱한",
                "조용한", "시끄러운", "게으른", "부지런한", "까칠한",
                "순진한", "뻔뻔한", "소심한", "당당한", "억울한",
                "심심한", "지친", "상쾌한", "촉촉한", "축축한",
                "말랑한", "딱딱한", "통통한", "쪼그만", "거대한",
                "새침한", "깜찍한", "엉성한", "허당인", "철없는"
        };
        String[] B = {
                "딸기", "사과", "포도", "오렌지", "바나나",
                "복숭아", "수박", "참외", "망고", "레몬",
                "체리", "자두", "키위", "파인애플", "귤",
                "감자", "고구마", "당근", "양파", "마늘",
                "두부", "만두", "김밥", "떡볶이", "라면",
                "붕어빵", "호빵", "도넛", "푸딩", "젤리",
                "강아지", "고양이", "토끼", "햄스터", "병아리",
                "펭귄", "판다", "너구리", "다람쥐", "오리",
                "구름", "별", "달", "돌멩이", "단추",
                "양말", "베개", "주전자", "숟가락", "리모컨"
        };
        Random rnd1 = new Random();
        String nameA = A[rnd1.nextInt(A.length)];
        String nameB = B[rnd1.nextInt(B.length)];

        return nameA + nameB;
    }// main
}
